templates/VerifyPaymentStatus.mustache

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:VerifyPaymentStatus>
        <tem:EntityID>{{EntityID}}</tem:EntityID>
        <tem:LocationID>{{LocationID}}</tem:LocationID>
        <!--Optional:-->
        <tem:PointOfSaleID>{{PointOfSaleID}}</tem:PointOfSaleID>
        <tem:CashierID>{{CashierID}}</tem:CashierID>
         <!--Optional:-->
         <tem:EntityTransactionID>{{EntityTransactionID}}</tem:EntityTransactionID>
         <!--Optional:-->
         <tem:EntityTransactionIDVerify>{{EntityTransactionIDVerify}}</tem:EntityTransactionIDVerify>
      </tem:VerifyPaymentStatus>
   </soapenv:Body>
</soapenv:Envelope>
